---
kind: property
id: P:Autodesk.Revit.DB.CurtainGridLine.Lock
source: html/835099bf-8511-65d8-bd42-746e992c7bca.htm
---
# Autodesk.Revit.DB.CurtainGridLine.Lock Property

Retrieves or changes the lock state of the curtain grid line.

## Syntax (C#)
```csharp
public bool Lock { get; set; }
```